In [1]:
import pandas as pd

In [3]:
raw_data={
    "city":["Sydney","Chennai","Madurai"],
    "rank":[1,2,3]
}

In [5]:
df=pd.DataFrame(raw_data,
                index=pd.Index(['a','b','c'], name='letter'),
                columns=pd.Index(["city","rank"],name="attributes")
               )

In [6]:
df

attributes     city  rank
letter
a            Sydney     1
b           Chennai     2
c           Madurai     3

In [9]:
df.iloc[1,0]

'Chennai'

In [12]:
df.loc['b','city']

'Chennai'

In [13]:
df.loc['b']

attributes
city    Chennai
rank          2
Name: b, dtype: object

In [15]:
df['city']

letter
a     Sydney
b    Chennai
c    Madurai
Name: city, dtype: object

In [19]:
df.at['b','city']

'Chennai'

In [20]:
df.iat[1,0]

'Chennai'

In [25]:
df.sort_values(by=['rank'])

attributes     city  rank
letter
a            Sydney     1
b           Chennai     2
c           Madurai     3

fillna

In [26]:
df.sort_values(by=['rank'],ascending=False)

attributes     city  rank
letter
c           Madurai     3
b           Chennai     2
a            Sydney     1